
//Задача 10 

//Console.WriteLine("Введите число: ");
//int num = Convert.ToInt32(Console.ReadLine());

    //if(num >= 100)
    //if(num < 1000)
    //{
       // int ten = (num % 100 - num % 10) /10;
      //Console.Write($"you number: " + ten);
    //}
   // else 
    //{
     //  Console.Write($"you number not a three-digit number ");
     // }


   // Задача 13 Напишите программу, которая выводит третью цифру 
   //           заданного числа или сообщает, что третьей цифры нет.

   //Console.WriteLine("Введите число: ");
   //int num = Convert.ToInt32(Console.ReadLine());
     
   //  if(num > 100)
   //  {
   //  int units = (num % 10);
  //   Console.Write($"Ваше число "  + units);
  //   }
  //   else
   //  {
  //        Console.Write($"третьей цифры нет ");
   //      }

// Задача 15 Напишите программу, которая принимает на вход цифру, обозначающую 
//           день недели, и проверяет, является ли этот день выходным.

//Console.WriteLine("Введите цифру дня недели: ");
//int num = Convert.ToInt32(Console.ReadLine());

   //if(num >= 6) 
   //if(num <= 7)
   //{
    //Console.WriteLine("Выходной день");
   //}
   // if(num <= 5) 
    //if(num >= 1)
    //{
    //Console.WriteLine("Будний день");
    //}
 






