//  Задача 1
//  Task1

//Console.Write("Введите число a: ");
//int числоa = Convert.ToInt32(Console.ReadLine());
//Console.Write("Введите число b: ");
//int числоb = Convert.ToInt32(Console.ReadLine());

//int a = 5;
//int b = 7;
// if(a > b)
 //{
//Console.WriteLine("min число " + a + ", max число " + b);
// }
//else 
//{
//Console.WriteLine("min число " + a + ", max число " + b);
// }

//  Task2

//Console.Write("Введите число a: ");
//int числоa = Convert.ToInt32(Console.ReadLine());
//Console.Write("Введите число b: ");
//int числоb = Convert.ToInt32(Console.ReadLine());

//int a = 2;
//int b = 10;
//if(a > b)
//{
//Console.WriteLine("min число " + a + ", max число " + b);
//}
//else 
//{
//Console.WriteLine("min число " + a + ", max число " + b);
//}

//  Task3

//Console.Write("Введите число a: ");
//int числоa = Convert.ToInt32(Console.ReadLine());
//Console.Write("Введите число b: ");
//int числоb = Convert.ToInt32(Console.ReadLine());

//int a = -9;
//int b = -3;
//if(a > b)
//{
//Console.WriteLine("min число " + a + ", max число " + b);
//}
//else 
//{
//Console.WriteLine("min число " + a + ", max число " + b);
//}

 //  Задача 2
 // Task 1

 //Console.Write("Введите число a: ");
//int числоa = Convert.ToInt32(Console.ReadLine());
//Console.Write("Введите число b: ");
//int числоb = Convert.ToInt32(Console.ReadLine());
//Console.Write("Введите число c: ");
//int числоc = Convert.ToInt32(Console.ReadLine());
//int a = 2;
//int b = 3;
//int c = 7;
//int max = a;
//if(max > b) max = b;
//if(max < c) max = c;
//{
//Console.WriteLine("max число = " + max);
//}

// Task 2

//Console.Write("Введите число a: ");
//int числоa = Convert.ToInt32(Console.ReadLine());
//Console.Write("Введите число b: ");
//int числоb = Convert.ToInt32(Console.ReadLine());
//Console.Write("Введите число c: ");
//int числоc = Convert.ToInt32(Console.ReadLine());
//int a = 44;
//int b = 5;
//int c = 78;
//int max = a;
//if(max > b) max = b;
//if(max < c) max = c;
//{
//Console.WriteLine("max число = " + max);
//}

// Task 3

//Console.Write("Введите число a: ");
//int числоa = Convert.ToInt32(Console.ReadLine());
//Console.Write("Введите число b: ");
//int числоb = Convert.ToInt32(Console.ReadLine());
//Console.Write("Введите число c: ");
//int числоc = Convert.ToInt32(Console.ReadLine());
//int a = 22;
//int b = 3;
//int c = 9;
//int max = c;
//if(max > b) max = b;
//if(max < a) max = a;
//{
//Console.WriteLine("max число = " + max);
//}

// Задача 3

// Task 1

//Console.Write("Введите число a: ");
//int числоa = Convert.ToInt32(Console.ReadLine());

//int a = 4;

//if(a % 2 == 0)
//{
//Console.WriteLine("число четное ");
//}
//else
//{
    //Console.WriteLine("число нечетное ");
    //}

    // Task 2

//Console.Write("Введите число a: ");
//int числоa = Convert.ToInt32(Console.ReadLine());

//int a = -3;

//if(a % 2 == 0)
//{
//Console.WriteLine("число четное ");
//}
//else
//{
    //Console.WriteLine("число нечетное ");
    //}


// Task 3

//Console.Write("Введите число a: ");
//int числоa = Convert.ToInt32(Console.ReadLine());

//int a = 7;

//if(a % 2 == 0)
//{
//Console.WriteLine("число четное ");
//}
//else
//{
    //Console.WriteLine("число нечетное ");
    //}

    // Задача 4

// Task 1

//Console.Write("Введите число N: ");
//int числоN = Convert.ToInt32(Console.ReadLine());

//int N = 5;

//if(N % 2 == 0) N = 2;
//if(N % 2 == 0) N = 4;
//{
//Console.WriteLine("число " + 2 + ", число " + 4 );
//}

// Task 2

//Console.Write("Введите число N: ");
//int числоN = Convert.ToInt32(Console.ReadLine());

//int N = 8;

//if(N % 2 == 0) N = 2;
//if(N % 2 == 0) N = 4;
//if(N % 2 == 0) N = 6;
//if(N % 2 == 0) N = 8;
//{
//Console.WriteLine("четные числа " +2+ "," +4+ "," +6+ "," +8);
//}


//Задача 10 

//Console.WriteLine("Введите число: ");
//int num = Convert.ToInt32(Console.ReadLine());

    //if(num >= 100)
    //if(num < 1000)
    //{
       // int ten = (num % 100 - num % 10) /10;
      //Console.Write($"you number: " + ten);
    //}
   // else 
    //{
     //  Console.Write($"you number not a three-digit number ");
     // }


   // Задача 13 Напишите программу, которая выводит третью цифру 
   //           заданного числа или сообщает, что третьей цифры нет.

   //Console.WriteLine("Введите число: ");
   //int num = Convert.ToInt32(Console.ReadLine());
     
   //  if(num > 100)
   //  {
   //  int units = (num % 10);
  //   Console.Write($"Ваше число "  + units);
  //   }
  //   else
   //  {
  //        Console.Write($"третьей цифры нет ");
   //      }

// Задача 15 Напишите программу, которая принимает на вход цифру, обозначающую 
//           день недели, и проверяет, является ли этот день выходным.

//Console.WriteLine("Введите цифру дня недели: ");
//int num = Convert.ToInt32(Console.ReadLine());

   //if(num >= 6) 
   //if(num <= 7)
   //{
    //Console.WriteLine("Выходной день");
   //}
   // if(num <= 5) 
    //if(num >= 1)
    //{
    //Console.WriteLine("Будний день");
    //}
 






